Revit 2027 API
ParameterTypeId.RebarElemTotalLength Property
 "Total Bar Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarElemTotalLength { get; }
Public Shared ReadOnly Property RebarElemTotalLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarElemTotalLength {
	ForgeTypeId^ get ();
}
static member RebarElemTotalLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace